[
  {
    "session": "97",
    "title": "Asynchronous to realtime web application for JVM",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2206",
    "length": "1",
    "group": "Friday9",
    "speaker": "Nilanjan Raychaudhuri",
    "text": "Web is evolving and as its evolving it brings out the new challenges for developers:<br><br>- How can we build applications that can scale?<br>- How can we work with multiple data streams?<br>- How can we build realtime web applications?<br><br>In this presentation I will introduce you to new set of abstractions that we developers need to build these modern web applications using Play framework."
  },
  {
    "session": "55",
    "title": "Continuous Integration and Deployment with Windows Azure Websites",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2202",
    "length": "1",
    "group": "Friday9",
    "speaker": "Adam Grocholski",
    "text": "Windows Azure enables developers to use a variety of workflows to automatically deploy code from the tools you’re already using, like TFS, CodePlex, and GitHub. This talk will focus on the various ways to deploy your projects to Windows Azure Web Sites, including git deployment, TFS deployment, continuous integration and custom scripts. Come join me and check out how easy it is to deploy your ASP.NET, Node, and PHP applications to the cloud."
  },
  {
    "session": "47",
    "title": "Creating scalable node.js appslications.",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2203",
    "length": "1",
    "group": "Friday9",
    "speaker": "Doug Martin",
    "text": "In this session I will talk about creating scalable Node.js applications, including but not limited to:<br>  * How to structure your project into small reusable components.<br>  * Logging<br>  * Configurations<br>  * Message queues <br>  * Worker processes"
  },
  {
    "session": "2006",
    "title": "Intro to Agile",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2207",
    "length": "2",
    "group": "Friday9",
    "speaker": "Stephen Bohlen",
    "text": "February 2011 marked the 10th anniversary of the Agile Manifesto but after all these years there are still plenty of people that haven’t embraced Agile and still have plenty of questions about it.  What is Agile and what does it mean for me?  How do I “become Agile”?  Is it right for myself and my organization?<br>  <br>In this session, we will explore the underpinnings of the Agile software movement, discuss the management and technical practices that can lead to successful Agile projects, and understand how they are all interdependent and co- reinforcing.  Attendees will better understand how Iterations, Test-Driven Development, Continuous Integration, and other practices can be used to provide a constant stream of timely and immediate feedback to the project development team, permitting rapid response to change over time.<br>  <br>The ideal attendee will have several years of experience in traditional, non-Agile projects and an interest in better understanding how Agile attempts to address the short-comings and invalid assumptions of tradition software engineering approaches."
  },
  {
    "session": "74",
    "title": "It's More Than Code",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2209",
    "length": "1",
    "group": "Friday9",
    "speaker": "Nate Taylor",
    "text": "Have you ever worked with someone that just amazed you with their development skills? The kind of guy who can look at your design, or listen to what you're going to do and find 3 reasons that won't work? Why can they see flaws in something before it's even written? What do they possess, or what experiences have they had, to be able to have these skills?<br><br>We'll look at several traits of quality software engineers. We'll examine each attribute in light of real world situations, and hopefully you'll leave with some areas that you can focus on in the future."
  },
  {
    "session": "82",
    "title": "Jump start: Begining Windows Phone 8 development",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2204",
    "length": "1",
    "group": "Friday9",
    "speaker": "Chad Adams",
    "text": "In this session we will go over the basics of building an application for the Windows Phone 8 platform, we will start from the very beginning on how to set up developer tools and provisioning a phone for device development; how to use Visual Studio 2012 and Blend 2012 for building an application's user interface, write code in C# for our application, adding art and giving our app a custom look and feel.  Finally, submitting an app to the Windows Marketplace.<br><br>Come see why Windows Phone development can be more fun building for than other mobile platforms."
  },
  {
    "session": "71",
    "title": "MVC - Getting Started",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2211",
    "length": "1",
    "group": "Friday9",
    "speaker": "Shawn Mehaffie",
    "text": "This session will cover the basics of using MVC and what models, controllers, and views are and how they work.  We will also cover some of the basics of the new Razor templating engine. A simple data entry application will be used to show the concepts of MVC. At the end of the session attendees should have enough knowledge to start working with MVC."
  },
  {
    "session": "83",
    "title": "Lean Metrics: How to Predict the Future",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2208",
    "length": "1",
    "group": "Friday9",
    "speaker": "Phil Ledgerwood",
    "text": "Estimating software projects, feature delivery dates, and even task completion times are notoriously difficult and unwieldy even for experienced teams. Guessing the future in terms of gut feeling or past experiences is a hit or miss practice that often leaves teams working overtime to meet unrealistic deadlines.  Some simple metrics tracking borrowed from Lean software development can help. In this session, you'll learn very simple techniques that enable you to project timelines and determine probabilities that are based on a team's actual performance instead of a guess."
  },
  {
    "session": "50",
    "title": "UX design for developers",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2203",
    "length": "1",
    "group": "Friday9",
    "speaker": "Andrew Dunkman",
    "text": "So you’ve heard this buzzword “user experience” before, probably out of some hipster’s beard-mouth. But what does it actually mean? <br><br>We’ll cover the basics of what it means to design software for user experience, including human factors in design, the user-centered design process, and a focus on human-computer interactions. Spoiler alert: it has very little to do with flashy graphics."
  },
  {
    "session": "6",
    "title": "WCF for Developers",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2210",
    "length": "2",
    "group": "Friday9",
    "speaker": "James Bender",
    "text": "WCF has been in production for some time now, and many enterprises are using it productively. But many developers have not yet had an opportunity to learn and use this exciting new technology. This session will show you the basics of WCF to get you started. We will create a service, host it and demonstrate it being called with several different endpoints. An overview of bindings, channels, behaviors and WCF security will also be provided. While it's clear that WCF is the best way to write services in .NET, many developers are afraid of it. They fear that WCF it too powerful, and by extension too complex to use for everyday service development. They have heard horror stories of long obtuse configuration files, and the bizarre rituals needed to deploy WCF services. They have been told that WCF is too heavy and complex to be useful.<br><br>This session will show you the truth about WCF! WCF, while powerful, is easy to understand, simple to develop in, straight forward to deploy and will not require you to strike a deal with the Devil in order to be productive. You'll see how easy it is to create, host and consume your first service. You'll see that terms like  Endpoint ,  Channel  and  Behavior  are nothing to be scared of. You'll learn the basics of REST and see how easy it is to create a REST service in WCF. You'll also be introduced to the WCF security model and some best practices for securing your services."
  },
  {
    "session": "26",
    "title": "When Automated Testing is a Waste of Time",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2205",
    "length": "1",
    "group": "Friday9",
    "speaker": "Wes Garrison",
    "text": "People have different ways of thinking about testing. Some focus on the regression aspect: later when I make a change, can I tell if I broke something?  Some think it's a waste. Some test after they've written their code.  Some write all the tests first, using them to think through the problems they are facing.<br><br>Automated testing has some cases where it's worthless and some cases where it's not. This talk is aimed at those that don't use automated testing much and wonder what all the hoopla is about, helping to find the line between when to test and when not to."
  },
  {
    "session": "79",
    "title": "Your Graph is Showing: The Trend toward Graph Databases &amp; Connected Data",
    "date": "2013-05-03T14:20:00+00:00",
    "dateMs": 1367590800000,
    "dateDisplay": "Fri, 9:20AM",
    "room": "2201",
    "length": "1",
    "group": "Friday9",
    "speaker": "Greg Jordan",
    "text": "One of the most tedious parts of a web application project has long been dealing with its database. The limitations of relational databases - particularly the time involved to change or update the model - have pushed us to alternatives.  <br><br>When NoSQL databases, such as MongoDB and Cassandra, came along they brought with them a simpler way to model data as well as a high degree of flexibility - or even a schema-less approach - for the model.<br><br>While document and key-value databases remove many of the time and effort hurdles, they are mainly designed to handle simple data.  However, the most useful, interesting and insightful applications require complex data that allows us to examine connections and relationships.<br><br>Graph databases - another type in the family of NoSQL databases - offer the blend of simplicity & speed while allowing data relationships to have first-class status. For example, social networks (e.g. Twitter's FlockDB) rely on graph databases for extremely fast access to complex data.<br><br>With the intersection of graph DBs capabilities, growth of interest (the 1st conference focused on graph technology – Graph Connect – was held in 2012) and the trend towards more connected, large sets of data, this session will demonstrate how the graph database will affect future web and mobile application development - specifically how graph databases will grow as a leading alternative to relational databases.<br><br>We'll start with a quick overview of the database landscape and how graph databases fit within it.  Next, we'll dive into neo4j, a popular graph database, and demonstrate how to solve complex, connected data problems with an in-depth look at examples demonstrating the power, speed and simplicity of using graph databases.  We'll close with a look at some caveats as well as glimpse into the future of graph databases."
  },
  {
    "session": "91",
    "title": "Achieving Project Peace of Mind",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2208",
    "length": "1",
    "group": "Friday10",
    "speaker": "Rob Keefer",
    "text": "Agile Project Management can be unsettling for many Project Managers due to the unfamiliar tools, apparent chaos, and lack of control. On the contrary, Agile Project Management methods provide a wealth of information that can be used to understand the real health of a project, with greater accuracy than traditional PM methods. Armed with this clearer understanding, Project Managers can have to a greater sense of certainty around their project’s progress, or as we like to call it: peace of mind. This presentation provides insights and understanding into the methods and metrics provided by Agile Project Management. We’ll explore what the measurement tools are, how to use them, and why these metrics work. Participants will ascertain tangible next steps they can implement in their next (or current) project, whether it is agile or not, to improve their peace of mind--and their project’s results."
  },
  {
    "session": "44",
    "title": "Analyzing Java Memory Usage and Leaks",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2206",
    "length": "1",
    "group": "Friday10",
    "speaker": "Barrie Selack",
    "text": "Never had a memory issue in Java? Consider yourself lucky. Unfortunately Garbage Collection can't solvle all your problems. There are many things that can cause your application to have memory issues. <br><br>In this session we'll take a look at free tools like the Eclipse Memory Analyzer Tool (MAT), JConsole/JMX and VisualVM/VisualGC that you can use to help identify those memory issues. I'll also be using a few of these tools in a live demonstration of finding the cause of a memory leak in code."
  },
  {
    "session": "63",
    "title": "Becoming an Outlier - Career Advice for the Developer Mind",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2209",
    "length": "1",
    "group": "Friday10",
    "speaker": "Cory House",
    "text": "As a developer, your image and your mind are your product. We’ll discuss the concrete activities and skills that transform average developers into outliers.  You’ll learn why developers can't afford cable, ways to improve your “luck surface area”, and techniques to compress your career through accelerated development. This session is loosely inspired by Malcolm Gladwell’s “Outliers”, Chad Fowler’s  The Passionate Programmer  and Seth Godin's  Poke the Box ."
  },
  {
    "session": "41",
    "title": "Code Contracts-Designing better software",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2214",
    "length": "1",
    "group": "Friday10",
    "speaker": "Amber Lufkin</a>&nbsp;<a href=\"/speakers/1084\">Marco Rentier</a>&nbsp;| Friday 10:30 | Rm2214 | 1 Hour </p><article class=\"session\">In this talk you will learn how .NET code contracts can help you become a better software developer.  We will cover what code-by-contract is and demonstrate core concepts and practical applications, in specific with respect to behavioral subtyping (Liskov substitution principle) and static analysis. Code-by-contract will teach you to think about code in an organized manner and help you write cleaner, more maintainable, code.</article></div><div class=\"sidebar\"><p><div style=\"width:195px; text-align:center;margin:auto;\" ><iframe  src=\"https://www.eventbrite.com/countdown-widget?eid=5224109452\" frameborder=\"0\" height=\"375\" width=\"195\" marginheight=\"0\" marginwidth=\"0\" scrolling=\"no\" allowtransparency=\"true\"></iframe><div style=\"font-family:Helvetica, Arial; font-size:10px; padding:5px 0 5px; margin:2px; width:195px; text-align:center;\" ><a style=\"color:#ddd; text-decoration:none;\" target=\"_blank\" href=\"http://www.eventbrite.com/r/ecount\">Event Registration Online</a><span style=\"color:#ddd;\"> for </span><a style=\"color:#ddd; text-decoration:none;\" target=\"_blank\" href=\"http://kcdc13.eventbrite.com?ref=ecount\">Kansas City Developer Conference 2013</a> <span style=\"color:#ddd;\">powered by</span> <a style=\"color:#ddd; text-decoration:none;\" target=\"_blank\" href=\"http://www.eventbrite.com?ref=ecount\">Eventbrite",
    "text": "In this talk you will learn how .NET code contracts can help you become a better software developer.  We will cover what code-by-contract is and demonstrate core concepts and practical applications, in specific with respect to behavioral subtyping (Liskov substitution principle) and static analysis. Code-by-contract will teach you to think about code in an organized manner and help you write cleaner, more maintainable, code."
  },
  {
    "session": "2005",
    "title": "Cross-Platform Dev using Marmalade (one set of source for IOS, Win8, Android and Blackberry)",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2204",
    "length": "1",
    "group": "Friday10",
    "speaker": "Greg Yotz",
    "text": "With todays many mobile platforms and with none of them sticking way out in front of the other, Most company’s are now gathering up multiple teams to create the same app over and over again on IOS, Windows 8 and then Android to stay ahead of the market place… During this One Hour session I will tell you about my experience with picking a cross platform development systems and how they helped me meet my goals and then to meet yours..."
  },
  {
    "session": "35",
    "title": "Infiltrate your .Net or Java team with Ruby",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2203",
    "length": "1",
    "group": "Friday10",
    "speaker": "Dusty Burwell",
    "text": "Do you love Ruby? Are you required to use some other sad panda language or platform at work? Do you have folks on your team that refuse to use Ruby because it's not compiled,  weakly typed,   untrustworthy,  or not from big daddy Microsoft? There are ways to sneak Ruby and other languages onto such a team. I know because I've done it.<br><br>I'll show you how my .Net entrenched Microsoft Gold Certified software team now builds, tests, and ships software using Ruby every step of the way. Our product may still be written in C# and run on Windows, but I get to play with Ruby every day and get paid for it. I am Ruby and so can you!"
  },
  {
    "session": "38",
    "title": "Java Batch Processing with Spring Batch",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2205",
    "length": "1",
    "group": "Friday10",
    "speaker": "David Pitt",
    "text": "This presentation will introduce and demonstrate how batch processing and ETL programs are implemented with java using the Spring Batch framework.<br><br>While most companies develop and support online applications that supply a user experience, almost all companies have some kind of batch processing needs. Many legacy environments support batch processing using the mainframe and COBOL/RPG. Others roll out their own by writing headless Java applications and implementing a mechanism to schedule and run (i.e. Java main() methods, or use a Java scheduling framework such as Quartz). However, there is not a consistent job definition mechanism, and a challenge is presented in trying to process large data sets and files both efficiently and timely.<br><br>A collaboration between Accenture and Spring Source, the Spring Batch framework has been designed to enable Java developers to process extremely large data sets with proven batch processing patterns using Java object oriented programming and the Spring framework. <br><br>Who Will Benefit: Managers, Architects, Leads and Developers who are developing software using Java technology.  <br><br>Presentation Topics<br><br>Batch Processing Requirements and History<br>Spring Batch Framework Introduction <br>Walk-through Example Spring Batch Program <br>Developing Batch Programs with Eclipse<br>Spring Batch Demo"
  },
  {
    "session": "68",
    "title": "My Experience Building a Windows Store App",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2211",
    "length": "1",
    "group": "Friday10",
    "speaker": "Jeff Fattic",
    "text": "A colleague of mine and I have been working on a Windows Store app on our free time. We really wanted to build this using best practices, but also stressing how much could be done with minimal effort. In this session, I'd love to show you how our app is put together. We'll touch on how I implemented MVVM, authorization, a service layer, and more."
  },
  {
    "session": "102",
    "title": "NuGet for the Enterprise",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2202",
    "length": "1",
    "group": "Friday10",
    "speaker": "Alex Papadimoulis",
    "text": "NuGet -- the open-source library package manager for .NET -- has exploded in popularity over the past two years with well over 5,000 available packages and support from major contributors such as Microsoft, NUnit, Castle, and JQuery. It’s an incredibly easy-to-use and very powerful tool that helps developers escape  dependency hell  while discovering new third-party libraries.<br> <br>But with great power comes great responsibility, and what works in the open source-world doesn't always translate to enterprise development... and that's especially true with NuGet. There are a whole lot of things to consider with NuGet in enterprise development environments, from out-of-control dependencies to quality assurance to open-source license compliance, and we'll cover most of these in this talk. We'll also do some hands-on with NuGet to get a feel for both creating and consuming library packages, and talk about how you can leverage NuGet to be an important part of your enterprise architecture."
  },
  {
    "session": "12",
    "title": "The 5 W's of Cloud Computing",
    "date": "2013-05-03T15:30:00+00:00",
    "dateMs": 1367595000000,
    "dateDisplay": "Fri, 10:30AM",
    "room": "2201",
    "length": "1",
    "group": "Friday10",
    "speaker": "Ralph Wheaton",
    "text": "A look at the 5 questions an enterprise must ask itself before moving to the cloud."
  },
  {
    "session": "4",
    "title": "A Web Developer's Illustrated Primer to Application Security",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2205",
    "length": "2",
    "group": "Friday12",
    "speaker": "Justin Ferguson",
    "text": "This two-hour session will be a walk-through of the top 10 Web Application security issues and how to build code and systems to avoid them.  The session will include live demonstrations of several real-world security vulnerabilities (in a lab environment).  The goal is to provide developers of all levels with some insight into  what are those security guys so worried about, anyway?  what's the worst that could happen?   Attendees will be provided with a checklist of  best practices for secure coding  to help them with avoid common security pitfalls."
  },
  {
    "session": "5",
    "title": "Beyond the Basics: Lucene and Solr",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2211",
    "length": "2",
    "group": "Friday12",
    "speaker": "Scott Smerchek",
    "text": "If you are already using Lucene and/or Solr (or even ElasticSearch), then this is the talk for you. We will go beyond the basics of these brilliant open source search platforms. Not only are there many ways to customize Solr through the standard configuration file, but there is so much more. Payloads offer up many possibilities for customization, including the ability to tag word with part of speech information. There is also a lot of ways to extend Lucene and Solr by creating your own filters, query parsers, tokenizers, token filters, and even highlighters with some simple Java code. If search is a core feature of your application, then you need to be using these advanced features to set yourself apart."
  },
  {
    "session": "2001",
    "title": "Building Windows 8 Apps with Caliburn.Micro",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2210",
    "length": "2",
    "group": "Friday12",
    "speaker": "Adam Barney",
    "text": "They've called the release of Windows 8 the greatest developer opportunity ever. This is your chance to put your app in front of hundreds of millions of potential buyers in the new Windows Store. But how will you build it? Caliburn.Micro - a simply amazing MVVM application framework for WPF, Silverlight and Windows Phone - has now been ported for use in WinRT applications. In this session, I'll show you how to get started using Caliburn.Micro for your Windows 8 application. I'll also talk about some lessons learned from using Caliburn.Micro for my first WinRT app, including leveraging some other open-source projects like Callisto in conjunction with Caliburn.Micro.  In part one of this two-part session, we'll cover the basics of Caliburn.Micro.  In part two, we dig in to how to code out app the Windows RT way using this amazing framework."
  },
  {
    "session": "1",
    "title": "Cloud Computing with Amazon Web Services",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2201",
    "length": "2",
    "group": "Friday12",
    "speaker": "Brent Clay",
    "text": "Up and Running: Brent Clay will lead you from creating a simple, static web site on the Amazon Cloud to deploying a load-balanced, secure and scalable RESTful Web Service, by progressively leveraging more advanced and powerful features of the Amazon Web Services (AWS) platform. You will learn the fundamentals of the DynamoDB Data Store, and how the underlying concepts of NoSQL and Eventual Consistency impact application performance and design; and how other AWS Application Services can be incorporated into your solutions to make them more fault tolerant, performant and scalable. By the end of the session, participants will be armed with the skills and practical knowledge to immediately begin adopting Amazon Cloud technologies to solve real-world problems."
  },
  {
    "session": "103",
    "title": "Get The Thread Out",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2202",
    "length": "1",
    "group": "Friday12",
    "speaker": "William Fink",
    "text": "Writing applications consisting of multiple threads can be complicated.   This presentation will help c# developers learn some of the features found in the System.Threading.Tasks namespace, which was introduced into the .net framework as of 4.0."
  },
  {
    "session": "105",
    "title": "Going Independent 101: Lessons learned from a decade of independence",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2209",
    "length": "2",
    "group": "Friday12",
    "speaker": "Michael Eaton",
    "text": "Breaking free from the confines of the cubicle farm and going out on your own can be one of the most satisfying things you do for your career. It can also be one of the most terrifying. Being on your own can seem like it's nothing but ponies, unicorns and rainbows, but it's a lot of work, and success is not guaranteed.<br><br>Mike, an independent developer since 2001, will discuss the lessons he's learned over the years along with the ups and downs he's experienced. In this updated and expanded session, he will help answer the most common questions he's been asked over the years.  How do I get started? ,  Where do I find clients? ,  How much do I charge? ,  Do I need a contract?  and many others. Bring your questions and find out if the grass really is greener on the other side."
  },
  {
    "session": "9",
    "title": "Introduction to iOS Development in .NET with MonoTouch and MonoDevelop",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2204",
    "length": "2",
    "group": "Friday12",
    "speaker": "Kevin Grossnicklaus",
    "text": "Have you ever wondered what would be required to utilize your .NET development skills to build native iOS apps that take full advantage of the iPhone and iPad hardware?  Many developers think that iOS development is a concept limited only to those willing do develop in Objective-C.  Thanks to the MonoTouch framework by Xamarin, .NET developers can write applications in C# that compile to native iOS applications and have full access to the native Apple hardware.   This session will provide an overview of MonoTouch, the development process it allows for, and will spend a significant amount of time CODING iOS APPS IN C#.<br><br>Topics to be discussed:<br><br>•    Development environment requirements (yes, you will need a Mac)<br>•    Tips for getting started and learning resources<br>•    Capabilities of MonoTouch vs. native Objective-C<br>•    Introduction to iOS concepts in MonoTouch including common controls and navigation paradigm.<br>•    An overview of using X-Code to design iOS user interfaces.<br>•    Using MonoDevelop as a development environment and how it compares to Visual Studio<br>•    Sharing code between a native .NET application and a MonoTouch/iOS application<br>•    Calling services from a MonoTouch application.<br><br>Will we write code?  YES.  You will see a full iOS application written in C# utilizing MonoTouch and MonoDevelop.  We will run and test the app on both an iPhone and an iPad.<br><br>Even if you are not immediately planning on building an iOS application, this session will be a great introduction to what would be required and what capabilities exist for .NET developers who may want to start considering the possibilities."
  },
  {
    "session": "7",
    "title": "Modern C++: Language and Standard Library",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2203",
    "length": "2",
    "group": "Friday12",
    "speaker": "Michael Price",
    "text": "The first C++ standard is more than 15 years old now; surely that has given you enough time to master such a wonderfully complicated language. Well think again! The first major revision to the standard was published in 2011.<br><br>Not only does the latest revision of the C++ standard contains many changes to the core language, but much of the benefit of adopting the new standard will come from the updates and additions to the C++ Standard Library.  Major industry players (i.e. Microsoft, Facebook, Google) have embraced the new features and are beginning to restore C++ to its former glory.<br><br>This session will cover many of the core language changes that make it easier to write fast, safe, and maintainable code, as well as many of the great new features of the standard library, including: smart pointers, function objects, containers, and concurrency primitives.<br><br>Previous knowledge of C++ is useful, but not strictly required."
  },
  {
    "session": "2222",
    "title": "Start Your Project Right",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2208",
    "length": "1",
    "group": "Friday12",
    "speaker": "Jonathan Mills",
    "text": "All to many projects are bound for trouble long before the first line of code is even written. In this session, we will discuss the things that every project team needs to do up front to ensure the greatest opportunity for success."
  },
  {
    "session": "8",
    "title": "Taste of Spring for Java",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2206",
    "length": "2",
    "group": "Friday12",
    "speaker": "Frank Moley",
    "text": "An introduction to the SpringSource Core framework for the Java Programming language. The session will focus on the concepts of the IOC container, aspecting, transaction support, data access, JMX, JMS, and some MVC."
  },
  {
    "session": "2",
    "title": "UX for Developers: Beyond Battleship Gray",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2214",
    "length": "2",
    "group": "Friday12",
    "speaker": "John Alexander",
    "text": "With the everchanging landscape of devices, web and native applications on both mobile and Desktop, developers are increasingly expected to understand how to create user experiences.   UX expectations are becoming more prevalent and sophisticated.  What's a Developer to do?  Never fear, this interactive and entertaining session will focus on some fundamental UX concepts and terminology to enable you to tackle this new and exciting frontier. Whether working on your own or with a designer, you'll be able to design and communicate more effectively."
  },
  {
    "session": "60",
    "title": "Zen Mind, Warrior Spirit: Mindsets for Agile Developers",
    "date": "2013-05-03T17:30:00+00:00",
    "dateMs": 1367602200000,
    "dateDisplay": "Fri, 12:30PM",
    "room": "2207",
    "length": "1",
    "group": "Friday12",
    "speaker": "Mario Aquino",
    "text": "While agile is not generally thought of as a software philosophy, the ideas and principles behind it have a balanced, Zen-like quality.  Zen thought is devoted to self-examination and mindful existence by following simple practices to achieve an understanding of life and the interconnectedness of things.  Where Zen's focus is on individual improvement, the activities of warfare apply to groups and include planning and estimation, cooperation on shared objectives, reflection on successes and failures, among others.  The Warrior Spirit lives behind the details and organization of warfare, and embodies an ethos of discipline, courage, selflessness, duty, and honor. These values strengthen the resolve of the warrior in the face of adversity, and provide a purposefulness to everyday activities. Two mindsets grounded in disciplined practices, have parallels with agile software development.  This technology-neutral talk describes how both Zen principles and the precepts of the warrior mindset can inform developers seeking mastery of their craft as well as better results in their business."
  },
  {
    "session": "13",
    "title": "Agile for the Waterfall Mind",
    "date": "2013-05-03T18:40:00+00:00",
    "dateMs": 1367606400000,
    "dateDisplay": "Fri, 1:40PM",
    "room": "2207",
    "length": "1",
    "group": "Friday1",
    "speaker": "Brian Blanchard",
    "text": "The transition from a waterfall methodology to a disciplined Agile methodology can be extremely painful and will likely fail if the concepts are not clearly understood by both the leadership and delivery teams.<br><br>This session walks through the fundamental changes to the approach of leading developers and working as an agile team.<br><br>Concepts covered: Test driven development, Pairing, Code Ownership, Agile Metrics, Cultural shifts, pitfalls & failures, and much more."
  },
  {
    "session": "29",
    "title": "The Silence of Agile",
    "date": "2013-05-03T18:40:00+00:00",
    "dateMs": 1367606400000,
    "dateDisplay": "Fri, 1:40PM",
    "room": "2208",
    "length": "1",
    "group": "Friday1",
    "speaker": "Steve Rogalsky",
    "text": "A collaborative culture is important for agile teams. However, we often use traditional brainstorming methods that can ruin our attempts at collaboration and engagement. In fact, decades of research has shown that traditional methods can actually be less collaborative, less engaging, and less creative than generating ideas individually and pooling them. Integrating silent brainstorming into your agile practices is a fantastic way to overcome this.<br><br>If you are already experienced in using silent brainstorming, this practical session will introduce you to the science and research to justify your approach. If you've never experienced silent brainstorming before, this session will give you something to try next week with your team that will help improve collaboration, engagement, and creativity. Regardless of your experience with silent brainstorming, you will learn how to integrate silent brainstorming into agile practices that you can use throughout the lifecycle of your projects and products.<br><br><br>Information for conference organizers:<br>This session has been presented many times at various conferences including SFAgile 2012 and Agile 2012. To see a video of this presentation: http://www.infoq.com/presentations/Silent-Brainstorming"
  },
  {
    "session": "9950",
    "title": "Windows Azure &amp; TFS Service Continuous Deployment",
    "date": "2013-05-03T18:40:00+00:00",
    "dateMs": 1367606400000,
    "dateDisplay": "Fri, 1:40PM",
    "room": "2202",
    "length": "1",
    "group": "Friday1",
    "speaker": "Jason Taylor",
    "text": "Learn how to use the Microsoft TFS Service to continuously deploy code to Windows Azure, and deal with multiple environment and build configurations."
  },
  {
    "session": "98",
    "title": "Actor model for Spring developers",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2206",
    "length": "1",
    "group": "Friday2",
    "speaker": "Nilanjan Raychaudhuri",
    "text": "I think actor based concurrency model is a paradigm shift. <br><br>What is paradigm shift?<br>A change in the basic assumptions, or paradigms, within the ruling theory of science.<br><br>The paradigm shift makes simple ideas hard to grok. Even though Actor model is a simple and revolutionary idea it becomes hard for programmers to see practical benefits and usage. One possible solution to this problem is to evaluate the new paradigm in terms of old paradigm. In this presentation we will take a working Spring based web application and gradually implement it using actors. We will be skeptical and suspicious of new ideas but at the same time we will be open minded. We will learn about actor based concurrency model using the knowledge of spring."
  },
  {
    "session": "45",
    "title": "Code Reviews - Remove the Pain, Increase Code Quality and Spread Knowledge",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2208",
    "length": "1",
    "group": "Friday2",
    "speaker": "Barrie Selack",
    "text": "Code reviews can be painful not only for the ones whose code is being reviewed, but for the code reviewer as well - they don't need to be. In this session I'll offer some tips and real world experiences about how you can improve your code review process or how to start doing code reviews if you are not doing them already. Code reviews are an important way to not only improve the quality of your code, but also a way to catch and minimize defects early. Code review is also an excellent way to spread knowledge, not just about the code itself, but about what other developers are building."
  },
  {
    "session": "72",
    "title": "HTML5 Enterprise Application Development for Desktop,Tablet, and Mobile devices",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2205",
    "length": "1",
    "group": "Friday2",
    "speaker": "David Pitt",
    "text": "This session will introduce an application architecture using frameworks and patterns that apply HTML5, JavaScript, and server side endpoints to build rich user interface web applications that are responsive to desktop,tablets, and mobile devices.   <br><br>The following topics will be discussed and demonstrated... <br>    <br>  * What is HTML5, and what does it bring to the table...<br>  *  Supporting desktop,tablet, and mobile users interfaces Using bootstrap framework for responsive CSS<br>  * Rich javascript User Interface Development using backbone<br>  * Modularity and dependency management<br>  * Restful JSON/Endpoint support<br>   *Authentication and Role based access"
  },
  {
    "session": "36",
    "title": "Implement your next feature with node.js: JavaScript in polyglot systems",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2203",
    "length": "1",
    "group": "Friday2",
    "speaker": "Andrew Dunkman",
    "text": "Have you seen one of those new-fangled node.js real-time web applications and wonder how to get that special sauce into your project, without being forced to convert it all to node.js?<br><br>We'll dig into using node.js for what's it's good at, while keeping your existing systems to avoid expensive rewrites. Take an exploration into infrastructure tools like messaging systems and reverse proxies to provide a seamless experience to your users."
  },
  {
    "session": "87",
    "title": "Intro to UX Research Methods",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2214",
    "length": "1",
    "group": "Friday2",
    "speaker": "Danielle Cooley",
    "text": "Take a brief look at some of the most popular research techniques today, including interviewing, journaling, card sorting, surveying, and field observation techniques."
  },
  {
    "session": "3336",
    "title": "Making Requirements Usable (and Helpful, Even!)",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2209",
    "length": "1",
    "group": "Friday2",
    "speaker": "Philip Japikse",
    "text": "Requirements are hard. But they don't have to be bad. I will show you tips, tricks, and tools that will make your requirements a valuable asset, and not just something that makes you roll your eyes when they are mentioned."
  },
  {
    "session": "51",
    "title": "NoSQL for SQL Professionals",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2201",
    "length": "1",
    "group": "Friday2",
    "speaker": "Matt Ingenthron",
    "text": "With all of the buzz around Big Data and NoSQL (non-relational) database technology, what actually matters for today's SQL professional? Learn more in this talk about big data and NoSQL in the context of the SQL world, and get to what's truly important for data professionals today.  In this presentation you'll learn: <br>    •    The main characteristics of NoSQL databases<br>    •    Differences between distributed NoSQL and relational databases<br>    •    Use cases for NoSQL technologies, with real-world examples from organizations in-production today"
  },
  {
    "session": "2007",
    "title": "Project Management and Unit Testing",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2207",
    "length": "1",
    "group": "Friday2",
    "speaker": "David Stanley",
    "text": "The drive for efficiency and accuracy in software project management, coupled with the rise in TDD and BDD methodologies gives the progressive PM a chance to measure not only earned value, but quality, as well."
  },
  {
    "session": "101",
    "title": "Racing Thru the Last Mile: Cloud Delivery Web-Scale Deployment",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2202",
    "length": "1",
    "group": "Friday2",
    "speaker": "Alex Papadimoulis",
    "text": "Explosive growth; millions of users; global 24/7 usage -- it's a dream wished by many and a nightmare experienced by few. It's the Web-Scale, and it's redefining how we create and deliver software. If a run-of-the-mill enterprise application is like a Honda, then a Web-Scale application is like a Formula 1 car -- engineering and maintenance challenges included. One missed detail, and you could lose the race, or worse, hit the berm and end up as a tangled-mess of scrap metal. <br><br>But unlike Formula 1, there are no pit stops or scheduled maintenance windows. Changes to Web-Scale applications must be error free and have no down-time... unless you want to face a mob of angry, demanding users somewhere in the world, and an even angrier mob of managers and investors. In this talk, we'll discuss various deployment strategies, scalable delivery, and how a few real-world Web-Scale organizations do it, from AllRecipes.com to Twitter, and even the monstrous Google."
  },
  {
    "session": "30",
    "title": "Reactive Extensions (Rx) For .NET and JavaScript",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2211",
    "length": "1",
    "group": "Friday2",
    "speaker": "Aaron Hoffman",
    "text": "In a short time System.Reactive will be as common as System.Linq is today.  Reactive Extensions (Rx) turns almost anything into an asynchronous, pushed-based stream of data.  Rx allows you to more easily solve many of the common pain points of application development today.  What if you could respond to events as easily as you iterate over collections today?  What if wiring up an asynchronous callback was as easy as composing a LINQ statement?  With Rx you can do these things and more!  With an ever increasing push toward asynchronous multi-threaded applications, why not get ahead of the curve and start using Rx today!  Also available in JavaScript!"
  },
  {
    "session": "48",
    "title": "Rescuing a PhoneGap Application",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2204",
    "length": "1",
    "group": "Friday2",
    "speaker": "Darren Cauthon",
    "text": "Building a native phone app like it was a website will quickly create a disaster of an app, one of which I was tasked to fix.  By showing you the problems and the way they were resolved, I'll show you how a PhoneGap project on the verge of cancellation made its way to the App Store."
  },
  {
    "session": "2216",
    "title": "TKO Knockout Knockdown",
    "date": "2013-05-03T19:50:00+00:00",
    "dateMs": 1367610600000,
    "dateDisplay": "Fri, 2:50PM",
    "room": "2210",
    "length": "1",
    "group": "Friday2",
    "speaker": "William Fink",
    "text": "Knockout is a MVVM framework for JavaScript and helps to bring sanity and order to RIA on the browser. Like jQuery, once you start using Knockout, it will become an indispensable tool in your developer's toolbox. No longer will developers have to spend hours working on the plumbing in order to coordinate the synchronization of controls and data. Knockout will knock out the mundane code, allowing the developer to concentrate on writing business solutions, not flimsy one-off frameworks.<br>My presentation will introduce developers to the Knockout framework and show examples on how it can be used with ASP.net MVC applications."
  },
  {
    "session": "86",
    "title": "Avoiding UI Mistakes",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2214",
    "length": "1",
    "group": "Friday4",
    "speaker": "Danielle Cooley",
    "text": "Everyone knows a good or bad user experience when they see it, but how do you provide the best possible experience to your users? In this course, UX expert Danielle Cooley dives into the 10 heuristics, providing specific examples of what to do and what not to do. If you can nail these 10 items, you will have created a noticeably superior experience for your users."
  },
  {
    "session": "77",
    "title": "Beyond User Tracking: Google Analytics for Web or Native Performance Metrics",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2202",
    "length": "1",
    "group": "Friday4",
    "speaker": "Dusty Burwell",
    "text": "You're probably developing on the latest generation MacBook Pro or an 8 Core Windows 8 Ultrabook with 16 GB of RAM while your users are likely running Windows XP with 3.5 GB of RAM and out of date video card drivers. Whether it's native or web based you want your users to have the best experience possible when running your product. But without a giant budget you can't possibly test the wide range of hardware and platforms out there. How do you know the performance characteristics of your application when running in the field?<br><br>What you need is to collect performance metrics and usage statistics from real users on real world devices. I'll show you one way of doing so using techniques that apply to both Web applications and .Net desktop applications."
  },
  {
    "session": "2008",
    "title": "Feeding your apps with Web API",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2206",
    "length": "1",
    "group": "Friday4",
    "speaker": "Gus Emery",
    "text": "This session will cover the many ways you can consume and feed your data through the new Web API<br>framework. Connectivity from MVC/Win8/Web/RT will be covered within this session. This session is a<br>must for programmers wanting a simple; however elegant solution to expose their data."
  },
  {
    "session": "16",
    "title": "Generating User Stories",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2207",
    "length": "1",
    "group": "Friday4",
    "speaker": "Anita Shankar",
    "text": "Successful projects depend on deeply understanding users needs. Too often though, during the transition from traditional methods to Agile, teams swing the pendulum too far in the other direction using “working software over comprehensive documentation” as an excuse to abandon capturing and communicating requirements. User Stories can be an extremely effective technique to communicate requirements, but they require the disciplined application of new skills. The good news is those skills can be acquired with a little guidance.<br> <br>Join Anita for a fun and interactive session that will show you: how to write strong user stories, the common pitfalls to avoid when writing user stories, what good acceptance criteria looks like, and how to still be effective without resorting to comprehensive documentation."
  },
  {
    "session": "2227",
    "title": "HTML5 - Applying Role Base Authorization Routing for Backbone.js",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2205",
    "length": "1",
    "group": "Friday4",
    "speaker": "Mark Determan",
    "text": "Many applications have a simple am i authorized? authorization requirement. However, some applications with a wider user base, require role based authorization. This talk will describe and demonstrate how the Backbone.jsMVC framework can be extended, to use the HTML5 data-? tag to support fine grained role based authorization routing support."
  },
  {
    "session": "19",
    "title": "Introduction to Netduino",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2211",
    "length": "1",
    "group": "Friday4",
    "speaker": "Jesse Phelps",
    "text": "I'm sure you've heard of Netduino but you may be wondering what it is all about, what you can do with it, and how to get started. Come find out! I will introduce you to Netduino and some basic electronics so that you too can write code for the physical world!"
  },
  {
    "session": "2238",
    "title": "Object-Oriented Design In the Wild",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2210",
    "length": "1",
    "group": "Friday4",
    "speaker": "Jessica Kerr",
    "text": "You're a great OO developer. Can you use this skill to conquer JavaScript or Haskell or Ruby? <br> There are truths about C# and Java that don't export, but other principles are universal. Dig into the reasoning behind object-oriented design principles, and find their application in the wider world. Come see how to apply skills you already have to languages you don't yet know. This session will challenge you to go beyond rules and standards and ask, when is clean code worth your time? Go beyond OO and come back with new insight. You'll go back to work on Monday with some hard questions to challenge your team."
  },
  {
    "session": "53",
    "title": "Pragmatic HyperMedia API Design",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2203",
    "length": "1",
    "group": "Friday4",
    "speaker": "Ian Joyce",
    "text": "Real world lessons on what works and what doesn't when designing and building a hyper media API."
  },
  {
    "session": "58",
    "title": "SQL Server's Last Breath",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2201",
    "length": "1",
    "group": "Friday4",
    "speaker": "Rob Sullivan",
    "text": "It's come to this: tonight's the night. All the waiting, the deadlocks, cruel licensing and devastating abuse to innocent SQL Statements… tonight's the night I let my Dark Passenger roam free and solve… finally solve this problem that plagues developers everywhere: SQL Server.<br><br>There it sits, pretending… just like me. Pretending to love my data and be an upstanding citizen of our development group. All the while… in the dark, fetid reaches of it's kernel it's silently plotting. Soaking up RAM and carefully laying licensing traps that will suck the blood from our company… But not this time.<br><br>This time I won't let it - and I have a plan. I won't do it alone - I'll bring in my trusty friend Postgres to confront SQL Server and force it to see the evil thing it's become for developers. And when the time is right, and SQL Server is strapped to the table begging to be set free, I'll pull out my favorite weapon of choice… shiny, simple, sharp and brilliant: Redis. <br><br>And I'll send it straight into SQL Server's heart once and for all."
  },
  {
    "session": "3340",
    "title": "Transitioning From Developer to Manager",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2209",
    "length": "1",
    "group": "Friday4",
    "speaker": "Boon Lee",
    "text": "Switching from developer to a manager can be a tricky transition. I sill discuss som ethings to help make that transition easier."
  },
  {
    "session": "2226",
    "title": "Windows 8 Phone: Backend services hookup",
    "date": "2013-05-03T21:00:00+00:00",
    "dateMs": 1367614800000,
    "dateDisplay": "Fri, 4:00PM",
    "room": "2204",
    "length": "1",
    "group": "Friday4",
    "speaker": "Jeff Julian",
    "text": "No data"
  },
  {
    "session": "67",
    "title": "Agile in a Highly Regulated Organization",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2207",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Tami Flowers",
    "text": "Can Agile be implemented, and successful, in a highly regulated, pseudo-government financial organization? The answer is yes.<br><br>Do you deal with internal auditors, external auditors, external examiners, and government agency oversight? Sarbanes Oxley, COBIT, and ITIL? Want to know how to implement Agile practices while satisfying all of these parties and controls? This session will cover ways to successfully implement Agile while maintaining a formal yet lightweight SDLC, including documentation and deliverables, and governance and compliance."
  },
  {
    "session": "22",
    "title": "Agile+: Beyond Practice-based Approaches",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2208",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Troy Tuttle",
    "text": "Why is the business of software hard?  Why do software projects seem to resist control when we try our best to keep them under control? Have you tried an Agile transformation/adoption at your organization with less-than-desired success? We will explore concepts from Complexity Theory, Systems and Lean Thinking, and Kanban for software in this unconventional Lean-Agile session and apply those models to real-world challenges.  With a better understanding of the more subtle (but important) dynamics in software development and human systems, you will have the basis for better project decision-making and organizational improvement."
  },
  {
    "session": "24",
    "title": "An Introduction to .NET Generics in C#",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2211",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Stephen Green",
    "text": "This session will introduce the concepts and conventions of .NET generics.  The discussion will start with a general definition accompanied with multiple examples.  The session will progress with various different syntax conventions and pitfalls when using generics. At the conclusion of the session, I will explore the advantages and benefits that generics provide in common development scenarios, along with potential risks that should be avoided."
  },
  {
    "session": "23",
    "title": "Analytics for Developers",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2203",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Trent Hauck",
    "text": "There are two overarching topics which I'd like to cover.  <br><br>First, what practices can a developer adhere to, to help ease measurement in the end.  This would cover site development and tools which can be used to help keep tracking code accounted for and easy to maintain.<br><br>Second, what happens when the developer is also the analyst.  The developer understands the site better than anybody, so it's only a natural they would use analytics to improve their initial design.<br>"
  },
  {
    "session": "2232",
    "title": "Building content solutions with Alfresco",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2205",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Richard Esplin",
    "text": "Alfresco is an open source Java based content repository that makes it easy to manage any kind of content such as office documents, PDF files, images, and media. Almost every developer will regularly deal with content, and this presentation will help you avoid common headaches and mistakes. We will introduce you to Alfresco and give you enough information that you can start building solutions. Get started now - sign up to www.alfresco.com/develop."
  },
  {
    "session": "34",
    "title": "Graphic Design for Programmers",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2214",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Garrett Pennington",
    "text": "Every project benefits from thoughtful visual design. In this session, attendees will learn to  develop  a design with the same methods and concepts they already know, such as abstraction and iteration. I will demonstrate how to use math and science to choose predictably pleasing color palettes and to create purposeful layouts. By understanding the principles of human visual perception, attendees will be able to identify patterns of successful design and immediately apply these patterns to enhance their websites and open-source projects."
  },
  {
    "session": "14",
    "title": "Hustling for Hackers v2.0",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2206",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Ricky Robinett",
    "text": "As a hacker, it's easy to spend all our time head down in code and forget to share what we've created. In this talk. I'll share some tips and tricks for hustling (without being a creep!) and talk about why I believe sharing your creations with the world just may change your life...or at least get you featured on national television. An expanded version of a talk I gave in SF last October."
  },
  {
    "session": "2224",
    "title": "Ignorance is bliss…until you get fired",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2202",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Andrew Alldredge",
    "text": "Recognize the inevitability of change, and the price of ignoring it. Make a change before it is forced, not when it is forced upon you. Four keys to career success."
  },
  {
    "session": "2104",
    "title": "Introduction to Development on Android devices",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2204",
    "length": "2",
    "group": "Saturday8",
    "speaker": "Muljadi Budiman",
    "text": "Interested in Android development?  (Introductory) help is here!<br><br>This session will introduce developers on how to start developing for the Android platform.  It'll cover the basics of setting up the emulator, developing software using Eclipse, hops through XML Layouts with typical controls, responding to events, handle orientation changes, and trying to access some hardware devices.  All in all, a cursory & fast look at how you can start creating apps in the Android environment."
  },
  {
    "session": "3333",
    "title": "Title: ASP.NET MVC Do’s and Don’ts",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2210",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Dallas Monson",
    "text": "There are many proverbs in the spirit of learning from other mistakes; such as, “The wise man learns from the mistakes of others, the fool has to learn from his own”.  While this may be a bit strong; you get the idea….<br>With the rapid adoption of ASP.NET MVC many have learned lessons the hard way.  This session will cover many Dos and Don’ts of ASP.NET MVC, general best practices to help speed your development and build better ASP.NET web applications with fewer iterations.  We will also cover challenges of integrating third-party applications with a web application build upon MVC."
  },
  {
    "session": "94",
    "title": "Why not reinvent the wheel or your knowledge is limited",
    "date": "2013-05-04T13:30:00+00:00",
    "dateMs": 1367674200000,
    "dateDisplay": "Sat, 8:30AM",
    "room": "2209",
    "length": "1",
    "group": "Saturday8",
    "speaker": "Seiya Kawashima",
    "text": "Don't reinvent the wheel  is a great saying that every software engineer/developer knows as the golden rule. However, it would prevent you from diving into the problems more deeply if you strictly follow. As a result, it would hurt your knowledge.<br><br>If you have not written data structures such as Tree, Map and others recently by yourselves or have used and been satisfied with Apache MINA, Multipurpose Infrastructure for Network Application or java.util.concurrent package for example, without learning how the technologies underneath them work, this session is right for you. Seiya talks about the points below.<br><br>1. How  Reinvent the wheel  is important.<br>2. How much you should reinvent the wheel.<br>3. Why you should spend some time to reinvent for efficiency, performance and expansion of knowledge. <br><br>Always keep in mind that  right algorithms + right data structures = optimized solutions  no matter how large your projects are. The equation is not that apparent from the APIs that you use and it is the core part if you care about performance."
  },
  {
    "session": "95",
    "title": "ASP.NET 4.5 for Web Forms Developers",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2210",
    "length": "1",
    "group": "Saturday9",
    "speaker": "Mitchel Sellers",
    "text": "There are a lot of us out there for a number of reasons that might not be working with ASP.NET MVC and might not have a plan to migrate to it anytime soon. With .NET 4.5 Microsoft proves that it isn't a big deal and added a bunch of much needed enhancements to the ASP.NET 4.5 Web Forms framework that brings some of the nicest features that were introduced in MVC to those of us using Web Forms.  In this practical demo we will investigate these new features and discuss how they can be used to help improve developer productivity!"
  },
  {
    "session": "2229",
    "title": "Agile Support for your production applications with Stackify",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2201",
    "length": "1",
    "group": "Saturday9",
    "speaker": "Matt Watson",
    "text": "Learn how to detect and resolve application problems faster with Stackify. Supporting production applications is easier with Stackify's integrated application management solution. Stackify gives developers the production access and tools they need to troubleshoot problems quickly. Lean more about their application monitoring, remote server access, and other features in this session."
  },
  {
    "session": "54",
    "title": "Asynchronous web programming with HTML5 WebSockets and Java",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2205",
    "length": "1",
    "group": "Saturday9",
    "speaker": "James Falkner",
    "text": "Over the last decade, advances in web computing have removed many of the barriers to entry for developers.  New languages, frameworks, and development methodologies have kickstarted new ideas and new ways to develop web applications to make modern life easier and more efficient.  WebSockets (introduced as part of HTML5) is one such technology that enables a new class of scalable, super-responsive, collaborative, and real-time web applications with a wide range of uses.<br><br>In this talk, we will first cover the basics of asynchronous web programming using WebSockets, including predecessors such as polling and long-polling, applications of WebSockets, its limitations and potential bottlenecks, and potential future improvements.<br><br>Next, we will demo and dissect a real-world use case for realtime social data analytics, using the Apache Tomcat implementation of WebSockets and the Java-based Liferay Portal Server.  This will include a discussion about development of WebSocket endpoints, its lifecycle within the application container and browser, debugging WebSockets, and scalability topics."
  },
  {
    "session": "3341",
    "title": "Behavior-Driven Development: Turning User Stories into Executable Specifications",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2206",
    "length": "2",
    "group": "Saturday9",
    "speaker": "Stephen Bohlen",
    "text": "You’re Agile.  You write User Stories.  Now what?  The next step is often to turn those User Stories into executable tests that can help you validate the proper behavior of your complex software systems.  Behavior-Driven Development (BDD) is the engine that can help to drive this process on your project.  The logical evolution of the often too fine-grained process of Test-Driven Development, BDD not only represents a somewhat different technical practice but, more importantly, it also suggests an entirely different way of thinking about your system and the way in which you test it. <br> <br>In this session we will begin with a series of simple User Stories and demonstrate how the BDD process supports our codifying these User Stories into a series of “executable specifications” that can be used to validate the proper functionality of our complex software system.  We will work at first without any of the complex overhead of so-called ‘BDD Frameworks’ to demonstrate the important concepts of BDD and then move on to investigate how and why one might look to use various ‘BDD Frameworks’ to offload some of the repetitive work often involved in the BDD process.  Attendees should expect to leave with a good understanding of both the conceptual process that is Behavior-Driven Development as well as some of the technical practices that can help support its successful adoption.<br> <br>The ideal attendee will have several years’ experience in developing complex software solutions.  Some understanding of the role of User Stories in the Agile software development process is helpful but not required.  Prior exposure to the concepts behind automated unit testing is assumed, but deep unit testing experience is not required."
  },
  {
    "session": "2103",
    "title": "C# from abstract to yield: How well do you really know C#?",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2214",
    "length": "1",
    "group": "Saturday9",
    "speaker": "Keith Dahlby",
    "text": "With each successive version, C# has added more and more keywords to do new and (mostly) exciting things. Before you can use them, you need to know they exist. From flagship language features like async and LINQ, to the subtleties of co- and contravariant generic type parameters, we'll discuss every language keyword and provide some context for when you might see it in the wild or want to use it yourself."
  },
  {
    "session": "85",
    "title": "Continuous Delivery of Complex Applications with TeamCity and Octopus Deploy",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2202",
    "length": "1",
    "group": "Saturday9",
    "speaker": "Jeff French",
    "text": "Summary:<br>     In this talk i will show you how to deploy a complex application to multiple environments with just the click of a button using TeamCity and Octopus Deploy.<br><br>Abstract:<br><br>     One of the main tenets of Agile development is to deliver business value to the production environment early and often. That's easy enough if you are delivering one small web app, but what if your application is composed of several web apps across multiple tiers with a large database and maybe even a few Windows services and scheduled tasks? Now you need a deployment system that is built to scale and allows you to automate all of these tasks to achieve consistency in your deployments. In this talk i will show you how to deploy a complex application to multiple environments with just the click of a button using TeamCity and Octopus Deploy."
  },
  {
    "session": "66",
    "title": "Interviews : Dos, Don'ts, Before, During, and After",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2209",
    "length": "1",
    "group": "Saturday9",
    "speaker": "Boon Lee",
    "text": "So, you are in an interview and things are just going great. You are just knocking it out of the park. You left feeling <br>confident that you will be getting a call with an offer. You did get the call but the conversation is not what you had <br>thought. Now you wonder why. I will share with you what I think happened. I will also share with you some things that you must do before, during, <br>and after the interview."
  },
  {
    "session": "9948",
    "title": "Managing Developers",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2207",
    "length": "1",
    "group": "Saturday9",
    "speaker": "Jonathan Mills",
    "text": "Developers in an agile environment are supposed to be “self managing” or “self organizing.” In that environment, what is a dev manager supposed to do? What should they do on a daily basis and more importantly, what should they not do. In this session we will look at some keys to managing these developers to enable them to be as productive as they can be."
  },
  {
    "session": "43",
    "title": "Pragmatic Architecture in. Net",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2211",
    "length": "1",
    "group": "Saturday9",
    "speaker": "Cory House",
    "text": "An architect’s job is to reduce complexity, not increase it. Yet the developer life is filled with jargon, acronyms, and seemingly infinite choices. So how do we know when complexity makes sense? We’ll learn when abstractions are justified and discuss how to structure applications so they’re maintainable, scalable, and testable. <br><br>We’ll make sure everyone is comfy with the core jargon like N-Teir, separation of concerns, and loose coupling. Then we’ll dive into various patterns for implementing the three common layers: data access, business logic, and presentation. You’ll learn when table module, active record, DDD, and ORMs make sense and walk away with the tools to better evaluate and justify complexity. We’ll focus on the value of keeping things simple whenever we can. Examples are presented in C# in Visual Studio but developers in Java, PHP, and other C-like languages should be able to follow right along."
  },
  {
    "session": "90",
    "title": "Seven Habits of Highly Effective Stakeholders",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2208",
    "length": "1",
    "group": "Saturday9",
    "speaker": "Rob Keefer",
    "text": "An Agile stakeholder, or manager, has the opportunity to be presented with a wealth of information over the course of an Agile project. Unfortunately, because this information is packaged differently than they are used to, stakeholders do not know what to do with the information. In this presentation we will look at 7 practices that the stakeholder role in an agile project can utilize to keep the team become focused and working at an optimal level."
  },
  {
    "session": "2228",
    "title": "Teach your kids how to program with Python and the Raspberry PI",
    "date": "2013-05-04T14:40:00+00:00",
    "dateMs": 1367678400000,
    "dateDisplay": "Sat, 9:40AM",
    "room": "2203",
    "length": "1",
    "group": "Saturday9",
    "speaker": "Juan Gomez",
    "text": "RaspberryPis are the new frontier in enabling kids (and curious adults) to get access to an affordable and easy-to-program platform to build cool things. Over a million of these nifty little devices have been sold in less than a year and part of their popularity has been due to how easy it is to start programming on them.<br><br>In this session you'll learn how to get started with the Raspberry PI, initial set-up, configuration and some tips and tricks. Then we'll have a brief introduction to basic Python and we'll write a few simple programs that run on the RaspberryPI. The last section of the session will be dedicated to PyGame, we'll learn about surfaces, events, inputs, sprites, etc and demonstrate how to build very simple games that are as much fun for kids to write, than to play!"
  },
  {
    "session": "92",
    "title": "10 Practices Every Team Should Be Doing",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2208",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Martin Olson",
    "text": "Agile, waterfall, scrum-butt, hope and pray;  Whatever development process your team is using there is always room for improvement.  Martin Olson will lead the participants through ten specific activities that your team should be doing to help themselves improve.  <br>The growing knowledge base indicates that self directed teams are more productive, have higher morale, produce higher quality and are better able to adapt to changes in the market place.   The practices included in this session are designed to help teams become more self directed, regardless of the organizational structure and development methodologies.  <br>If you are doing one or more of the practices, this session should help you evaluate what you are doing right and what you might want to improve.  If you are not doing any of the practices, the session will arm you with the basics to start improving your work environment now.<br>The list is based on Martin's real world experience of coaching different teams over the last twelve years."
  },
  {
    "session": "33",
    "title": "Ajax Best Practices",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2203",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Garrett Pennington",
    "text": "This session covers ajax best practices with a heavy emphasis on jQuery. Topics covered include writing unobtrusive javascript, language-independent server side techniques, event bubbling, exception handling, performance optimization, and testing. Attendees will learn how to create more sustainable, gracefully degrading web applications that enhance human interaction with thoughtful ajax."
  },
  {
    "session": "88",
    "title": "Be better at coding",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2209",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Yair Segal",
    "text": "•    What do we code for<br>•    Define a better coder<br>•    Be a better coder<br>•    Interview/ date tips<br><br>I will share some of my previus experiances tallking about the passion of creating code."
  },
  {
    "session": "100",
    "title": "Clean JavaScript: Taming the Unicorn",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2210",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Patrick Delancy",
    "text": "Are you promiscuous with your JavaScript code? Strewing functions and commands here and there? Nested closures, manual obfuscation, global functions... all of these  natural  JS conventions seem to be at odds with readable, maintainable code and SOLID development principles.<br><br>In this session we will take a look at why JS seems to be so difficult to write cleanly, and discuss some of the tools and practices that can help change that."
  },
  {
    "session": "73",
    "title": "Designers? We don't need no stinkin' Designers! (Great UI Made Easy)",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2214",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Jon von Gillern",
    "text": "Every single pixel on your website conveys information. Is it conveying the right information? In this session you'll learn that you don't need a some latte sipping dude in a black turtle neck to create a compelling User Interface. We'll cover simple principles on how you can easily and effectively use Color, Saturation, Opacity, Contrast, Shape, Font, Size and Animation in any application. These principles will make your site easier to view, understand and consume, bringing your code closer to your user."
  },
  {
    "session": "61",
    "title": "Git Happens",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2202",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Jessica Kerr",
    "text": "Git Happens: Git: it's all the rage in source control. You may use it, but do you understand it? A million tutorials on the internet<br>tell you what to type, but not why. Let me show you in<br>pictures what's going on behind the scenes in git. Learn how to navigate, write, and untangle your commit history. Do more than control your source: make it tell a story. After this talk, git will make sense, and so will your project history."
  },
  {
    "session": "70",
    "title": "How to Simplify Agile Planning and Estimating",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2207",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Tami Flowers",
    "text": "As a former developer and eternal optimist, I was a terrible estimator, so created and evolved a planning and estimating process that is still used today.  <br><br>Estimating is hard. Customers and managers want to know how long a project will take and how much it will cost. Agile estimating and planning is difficult and challenging because it’s an on-going, continuous process. So, how do you get an estimate together…before a project is approved…that is accurate when you don’t yet know all of the details? How, and when, do you keep refining that plan and estimate?<br><br>This session is for developers, business analysts, project managers, customers and managers who want insight in how to make the planning and estimating process easier. In this session you will see an organic estimating and planning process that an organization has evolved over the past 6 years that has been tried and tested, and proven to be reliable and fairly accurate."
  },
  {
    "session": "2105",
    "title": "SOA in an Hour",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2201",
    "length": "1",
    "group": "Saturday10",
    "speaker": "James Nugent",
    "text": "This session explores the relationship between SOA, EDA, DDD, CQRS and a whole host of other acronyms, and looks at some ways of implementing them in order to break apart existing monolithic applications or to try and avoid big balls of mud in the first place! We'll take a whistle-stop tour through several messaging patterns and look at how you can put a UI on top of an application you've broken apart into services.<br><br>"
  },
  {
    "session": "37",
    "title": "TypeScript: Beyond JavaScript",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2205",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Jake Adams",
    "text": "If you wish JavaScript had more of the features you love about .NET (type checking, classes, etc.) then TypeScript is for you. From Anders Hejlsberg, the creator of C#, TypeScript is a language that compiles down to JavaScript. This session will cover everything you need to know to begin using TypeScript."
  },
  {
    "session": "69",
    "title": "Whats New in Visual Studio and Team Foundation Server?",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2211",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Jeff Fattic",
    "text": "Even if you have seen the presentations of the Visual Studio 2012 launch event, you may not be aware of all of the new features. Microsoft is rolling out new updates on a very rapid pace. This session will highlight some of what's new since the launch - including changes to Visual Studio, Team Foundation Server, and the Team Foundation Service."
  },
  {
    "session": "2002",
    "title": "Windows 8 Smackdown - Building Apps in XAML and JavaScript",
    "date": "2013-05-04T15:50:00+00:00",
    "dateMs": 1367682600000,
    "dateDisplay": "Sat, 10:50AM",
    "room": "2204",
    "length": "1",
    "group": "Saturday10",
    "speaker": "Tom Walton",
    "text": "This session is a fun-filled comparison of building Windows 8 applications in XAML vs. JavaScript.  You will learn how the technologies stack up and see Windows 8 applications in action."
  },
  {
    "session": "2217",
    "title": "Agile Open Space",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2208",
    "length": "2",
    "group": "Saturday12",
    "speaker": "Bryan Nehl",
    "text": "Open Space session for Agile Software Development topics."
  },
  {
    "session": "2003",
    "title": "Bullets Kill People: Building Presentations that Don’t Suck",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2209",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Jay Harris",
    "text": "Effective communication is a pivotal component of a success. Be it presenting at a user group, assisting with a Sales demo, or simply justifying to your boss the purchase of IDE upgrades, you will give a presentation in your career. But the effectiveness of your presentation is not just about being well-spoken and having a prepared outline; the quality of a slide deck has as much impact on a presentation as the quality of the speaker. Slides can destroy. Slides can invigorate. Slides can shape the mood of your audience and bend it at will. Learn to harness this power; use it to tell your story effectively, persuasively, and leave your audience inspired."
  },
  {
    "session": "11",
    "title": "Chocolatey goodness - What...",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2205",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Rob Reynolds",
    "text": "Chocolatey is a global PowerShell execution engine. What does that mean? I'm not sure but it does some really cool stuff.<br><br>For instance, if you lose your car keys you can just pull up a command line and type - chocolatey where are my keys? and it will respond with  Please run chocolatey /? or chocolatey help .<br><br>Okay bad example, but it definitely does some cool things like save you time and make you look uber smart for using it. Come see what this thing is and what it can do for you.<br><br> Sometimes it's the tools that make the man.  -Rob Reynolds, like 2 seconds ago"
  },
  {
    "session": "49",
    "title": "DevOps: Automating Your Infrastructure with Puppet",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2202",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Scott Smerchek",
    "text": "Puppet is an open source project built by PuppetLabs (http://puppetlabs.com) to automate the management of your IT infrastructure. Whether you manage a hosted environment or you run your own servers in-house, Puppet can help alleviate management headaches. Puppet lets your declaratively describe what a machine should look like, and then makes it happen (and makes sure it stays that way). This talk will go over the basics of Puppet, including: how to get started, the essentials of Puppet modules, using existing modules on the Puppet Forge, running Puppet on Windows. It will also touch on how to write a basic module."
  },
  {
    "session": "93",
    "title": "Going Postal with postal.js",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2206",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Nicholas Cloud",
    "text": "postal.js is an in-memory service bus for server and client-side JavaScript development. Nicholas will discuss the differences between a service bus and the traditional node.js eventing model, while demonstrating feature differences between postal.js and EventEmitter. He'll then move to the browser and show how postal.js can augment client development; specifically, how it works charmingly with jQuery."
  },
  {
    "session": "39",
    "title": "Introduction to CQRS and DDD",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2210",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Robert Macdonald Smith",
    "text": "CQRS (Command Query Response Segregation) is a relatively new technique for composing systems that have an optimized “write side” and an optimized “read side”. Domain Driven Design is gaining popularity since Eric Evans published his Blue Book back in 2008. Using these two techniques of software design offers a powerful combination when approaching a complex domain.<br>CQRS strives to partition your system in to a “write side” (that handles command processing) and a “read side” (that handles events generated by your domain model). When you throw Event Sourcing in to the mix, this fits nicely with the domain model of DDD and can actually help to simplify the code within your domain and reduce accidental complexity (think ORM).<br>In this session I will demonstrate some of the core concepts of CQRS with event sourcing and DDD in a basic sample application. Terms such as eventual consistency and event sourcing will be defined.  I will explain how to write your commands, how commands are handled by the domain model, how events are defined and how they are raised by the domain, how events are consumed to update the read model.  <br>Since CQRS, event sourcing and DDD are large topics in their own right, I will keep the session as more of an overview of core concepts supported by the sample application."
  },
  {
    "session": "2010",
    "title": "Modularizing Rails Apps",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2204",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Kevin Shekleton",
    "text": "So, you've been writing Rails apps and find yourself writing the same common logic across multiple applications. Rather than duplicating the same logic across the apps, you know there must be a better way to share this functionality.<br><br>Rails has a great modular architecture allowing you to take components and integrate them into your application. We'll walk through the various ways in which you can modularize and DRY up your shared functionality to best fit your needs.<br><br>Plugins? Engines? Full? Mountable? Railties?<br><br>This talk will explain each concept, what they are best suited for, and how you can take advantage of them. We will also cover how these concepts are changing in Rails 4 so you'll prepared when it is released."
  },
  {
    "session": "65",
    "title": "My Peer Partner is Blind",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2201",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Mark Randolph",
    "text": "No. Really. She is blind. Always has been. Nonetheless she is is on track to be a Java 1.6 Certified developer, is a full contributing member of our Scrum team, and is kickass with Quick-Keys. This session is about peer programming, coaching, the value and limits of determination,  Deliberate Practice,  and humility. Need a story to inspire others? Come hear ours!"
  },
  {
    "session": "32",
    "title": "Open Sourcery: Using Open Source Powers for Good",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2203",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Vanessa Hurst",
    "text": "Straight up, developers have superpowers. We also have some of the coolest, most effective collaborative communities in modern society: open source development teams. But we can do even better. This talk covers a brief overview of supreme awesomeness in social impact coding, supreme accomplishments in open source, and a model for combining the two to build software that saves the world."
  },
  {
    "session": "2101",
    "title": "SOLID Design Patterns for Mere Mortals",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2214",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Philip Japikse",
    "text": "Software design patterns have been around long before the MVC Framework gained momentum. In this session we will start with a review of Robert C. Martin's (Uncle Bob) SOLID macronym. After building the proper foundation, I will show you several design patterns, their C# implementation, and when and how they should be used in modern software development."
  },
  {
    "session": "10",
    "title": "Scaling Agile to the Enterprise: An Overview of SAFe",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2207",
    "length": "2",
    "group": "Saturday12",
    "speaker": "Martin Olson",
    "text": "Structuring, leading and supporting highly productive teams is difficult.  However, when it is done well the results are significant.  Faster ROI, increased morale, and higher quality are just a few of the benefits often referenced when talking about the benefits of such a team.  Given the challenges associated with building and leading individual teams, what can one expect when trying to leverage these benefits across multiple teams or an entire division.  How does the organizational structure of your company support or impede an enterprise strategy that looks to leverage the intelligence of the work force.  What role should management play?  How do we know we're on the right track?<br>In this session Martin Olson will provide an overview to the Scaled Agile Framework.  We'll talk about the challenges and possible solutions available to synchronize and focus the efforts of different teams across the enterprise, even geographically different teams.  This session assumes that the participant has a working understanding of agile and lean terms and theories."
  },
  {
    "session": "25",
    "title": "Technical Debt: Stop Mortgaging Your Code",
    "date": "2013-05-04T17:30:00+00:00",
    "dateMs": 1367688600000,
    "dateDisplay": "Sat, 12:30PM",
    "room": "2211",
    "length": "1",
    "group": "Saturday12",
    "speaker": "Stephen Green",
    "text": "Understanding the implications of technical debt has become a necessity in both large and small development efforts.  During this session, I will be introducing the concept of technical debt, along with the long term impacts of creating debt in exchange for faster development cycles. At the conclusion of the session, I will explore strategies and processes for reducing debt during project engagements."
  },
  {
    "session": "64",
    "title": "Everything you need to know about REST",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "2205",
    "length": "1",
    "group": "Saturday1",
    "speaker": "James Bender",
    "text": "RESTful services are the next big new, yet not so new thing. After years of dealing with SOAP Developers, Architects and even Users are looking for a simpler alternative for working with resources on the net. REST based services provide a simple and intraoperative way to use web services in everything from C to JavaScript. In this session you'll learn everything you need to know about designing and developing REST services. We'll discuss routing, HTTP verbs, return codes and designing service routes. You'll be shown some simple and free tools to help you develop and test your services and you'll learn how to quickly and easily create your own REST services (to return POX and JSON) in .NET using WCF, ASP.NET Web API or ASP.NET MVC."
  },
  {
    "session": "76",
    "title": "Intro to Groovy and Grails",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "22214",
    "length": "1",
    "group": "Saturday1",
    "speaker": "Shane Davenport",
    "text": "Brief overview of Groovy and Grails and what some of the advantages are over just using Java. How to get it working in Eclipse and some of the other IDE used for development.  Explanation of MVC (Model View Controller) and how it is used in a grails application."
  },
  {
    "session": "42",
    "title": "Modern Architectures for Cross-Platform Development",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "2201",
    "length": "1",
    "group": "Saturday1",
    "speaker": "Jeff Strauss",
    "text": "In today's software world, the app is king.  And with apps becoming ever more essential to today’s business, entertainment, and personal life, it almost goes without saying that any new development project or consumer product will eventually need to target multiple clients on multiple devices.  As a developer who may end up writing for the phone, tablet, web, and desktop, it can be critical to make the correct choices up front in terms of your team's development patterns and application architecture.<br><br>In this one-hour session, we will discuss some of the pitfalls faced by teams today.  Particularly for apps that are already in production, what limitations may there be to extending for the mobile and tablet world?  And if you are building from the ground up, what choices do you have to create a robust, flexible, accessible server and API that can be used by your own client app dev teams, as well as third-party API consumers who can extend your brand even further.<br><br>Our technical focus will largely remain agnostic to your chosen database technology, SQL (or NoSQL), and other back-end logic.  Instead, we will look at the services and client tiers.  The discussion will weigh the pros and cons of WCF (with JSON and SOAP endpoints), as well as building RESTful services with the newer MVC 4 Web API.  Client-side technologies could be anything, but we will certainly consider at least clients for the web, iOS (via MonoTouch), and XAML/WinJS for Windows 8."
  },
  {
    "session": "20",
    "title": "RabbitMQ - The Polyglot Messaging Platform",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "2202",
    "length": "1",
    "group": "Saturday1",
    "speaker": "Tyrone Groves",
    "text": "This session will discuss what RabbitMQ is and provided an overview of the features.  We will deep dive into scenarios where known pattens are a good solution to common architectural problems."
  },
  {
    "session": "99",
    "title": "Sniffing Out Success: Identifying Smells and Anti-Patterns in Your Code",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "2210",
    "length": "1",
    "group": "Saturday1",
    "speaker": "Patrick Delancy",
    "text": "This session will review some of the most common and dangerous code smells and anti-patterns with some debate about why they should be avoided. There will be many examples and a lot of interactive discussion to help us learn the virtues of identifying anti-patterns in our code and how to fix them. Learn cool new terms like object orgy, shotgun surgery and contrived complexity! Become a better developer! Impress your friends!"
  },
  {
    "session": "2100",
    "title": "Tales from the table",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "2209",
    "length": "1",
    "group": "Saturday1",
    "speaker": "Nate Taylor",
    "text": "Apparently, I'm unusual because I actually enjoy interviewing people for development jobs. I'm excited about the possibility to bring in new talents, or finding someone who's area of specialty is exactly what we need. But most people dread interviews. Interviewers are aware of the fact that only a fraction of interviews will turn into an integral part of their team. Interviewees are aware of the fact that they're being judged and put on display.<br><br>In this talk we'll focus on lessons I've learned from both sides of the interview table. The emphasis will primarily be on helping the interviewee do a better job and feel more comfortable when they're being interviewed. We will NOT be focusing on how to solve the technical challenges of an interview, but rather things that you can do almost regardless of what the interviewer asks you."
  },
  {
    "session": "17",
    "title": "TypeScript: The Good Parts",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "2203",
    "length": "1",
    "group": "Saturday1",
    "speaker": "Jeremy Mason",
    "text": "We will be exploring TypeScript, one of the latest ideas to come out of Redmond.  TypeScript is a new language based on JavaScript, but with a few added features, such as static typing, modules, and inheritance.  Those in attendance will walk away with a basic understanding of what TypeScript has to offer, and how to start using it in their web projects.  Javascript experience is a plus, but not recommended."
  },
  {
    "session": "75",
    "title": "Windows 8 - The JavaScript Story",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "2211",
    "length": "1",
    "group": "Saturday1",
    "speaker": "Clint Edmonson",
    "text": "With the release of Windows 8, Microsoft has delivered a rich client application platform that is both powerful and approachable. Apps on this platform install easily and uninstall cleanly. They run in a single window that fills the entire screen by default. They automatically work with a variety of input sources, including touch, pen, mouse, and keyboard. Instead of static icons, they use live tiles that can display notifications. Best of all, these apps can be written using HTML5, CSS, and JavaScript. <br><br>This session will provide an overview of the platform and show Microsoft’s innovative approach to building these next generation apps for Windows 8."
  },
  {
    "session": "104",
    "title": "XAML Styles and Templates: An Introduction",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "2206",
    "length": "1",
    "group": "Saturday1",
    "speaker": "Michael Eaton",
    "text": "You’re a developer, not a designer, but with no designer on the team, it’s your job to make your WPF or Silverlight application look good. With a little effort and an understanding of styles and templates, you can impress your users with a compelling, easy-to-use application. You’ll learn the ins and outs of styles, understand when and where to use templates and much more from a developer experienced in not only writing WPF and Silverlight apps, but in making them look good too!"
  },
  {
    "session": "78",
    "title": "iOS Development",
    "date": "2013-05-04T18:40:00+00:00",
    "dateMs": 1367692800000,
    "dateDisplay": "Sat, 1:40PM",
    "room": "2204",
    "length": "1",
    "group": "Saturday1",
    "speaker": "Becky Isserman",
    "text": "Ever wonder what you need to work with iOS Development?  We will answer such questions in this session as:<br>-Do I need an Apple computer to work with iOS Development?<br>-Can I use C#?<br>-What type of compilers do I need to build iOS application?<br>-How do I get into the app store?<br>-What resources are available to learn iOS Development?"
  }
]